XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    if(USART4_GPIO_Flag == false)
    {
      USART4_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART4_Tx, ENABLE);  /* Enable USART4_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART4_Rx, ENABLE);  /* Enable USART4_Rx GPIO clock */
      
      GPIO_PinAFConfig(GPIO_USART4_Tx, GPIO_PinSource_USART4_Tx, GPIO_AF_UART4);  /* Connect GPIOxn to USART4_Tx */
      GPIO_PinAFConfig(GPIO_USART4_Rx, GPIO_PinSource_USART4_Rx, GPIO_AF_UART4);  /* Connect GPIOxn to USART4_Rx */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART4_Tx;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(GPIO_USART4_Tx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART4_Rx;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(GPIO_USART4_Rx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART5)
  {
#if (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx)
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART5_SendData_Flag = false;
    USART5_SendData_P    = NULL;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
    
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART5_ReceiveData_P = NULL;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
    
    if(USART5_RCC_Flag == false)
    {
      USART5_RCC_Flag = true;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE); /* Enable USART5 clock */
    }
    
    if(USART5_GPIO_Flag == false)
    {
      USART5_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART5_Tx, ENABLE);  /* Enable USART5_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART5_Rx, ENABLE);  /* Enable USART5_Rx GPIO clock */
      
      GPIO_PinAFConfig(GPIO_USART5_Tx, GPIO_PinSource_USART5_Tx, GPIO_AF_UART5);  /* Connect GPIOxn to USART5_Tx */
      GPIO_PinAFConfig(GPIO_USART5_Rx, GPIO_PinSource_USART5_Rx, GPIO_AF_UART5);  /* Connect GPIOxn to USART5_Rx */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART5_Tx;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(GPIO_USART5_Tx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART5_Rx;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(GPIO_USART5_Rx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx) */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx)
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART6_SendData_Flag = false;
    USART6_SendData_P    = NULL;
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
    
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART6_ReceiveData_P = NULL;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
    
    if(USART6_RCC_Flag == false)
    {
      USART6_RCC_Flag = true;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);  /* Enable USART6 clock */
    }
    
    if(USART6_GPIO_Flag == false)
    {
      USART6_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART6_Tx, ENABLE);  /* Enable USART6_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART6_Rx, ENABLE);  /* Enable USART6_Rx GPIO clock */
      
      GPIO_PinAFConfig(GPIO_USART6_Tx, GPIO_PinSource_USART6_Tx, GPIO_AF_USART6);  /* Connect GPIOxn to USART6_Tx */
      GPIO_PinAFConfig(GPIO_USART6_Rx, GPIO_PinSource_USART6_Rx, GPIO_AF_USART6);  /* Connect GPIOxn to USART6_Rx */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART6_Tx;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(GPIO_USART6_Tx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART6_Rx;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(GPIO_USART6_Rx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx) */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx)
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART7_SendData_Flag = false;
    USART7_SendData_P    = NULL;
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
    
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART7_ReceiveData_P = NULL;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
    
    if(USART7_RCC_Flag == false)
    {
      USART7_RCC_Flag = true;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART7, ENABLE); /* Enable USART7 clock */
    }
    
    if(USART7_GPIO_Flag == false)
    {
      USART7_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART7_Tx, ENABLE);  /* Enable USART7_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_USART7_Rx, ENABLE);  /* Enable USART7_Rx GPIO clock */
      
      GPIO_PinAFConfig(GPIO_USART7_Tx, GPIO_PinSource_USART7_Tx, GPIO_AF_UART7);  /* Connect GPIOxn to USART7_Tx */
      GPIO_PinAFConfig(GPIO_USART7_Rx, GPIO_PinSource_USART7_Rx, GPIO_AF_UART7);  /* Connect GPIOxn to USART7_Rx */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART7_Tx;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(GPIO_USART7_Tx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = GPIO_Pin_USART7_Rx;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(GPIO_USART7_Rx, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART8)
  {
#if (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx)
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART8_SendData_Flag = false;
    USART8_SendData_P    = NULL;
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
    
