XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    DMA_DeInit(DMA1_Stream6);                         /* Deinitialize the DMA1 Stream6 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE); /* Wait for the specified DMA1 Stream6 reset to complete. */
    
    DMA_Init(DMA1_Stream6, &DMA_InitStructure); /* Initializes the DMA1 Stream6. */
    DMA_Cmd(DMA1_Stream6, DISABLE);             /* Disables the specified DMA1 Stream6. */
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    USART3_DMA_Tx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_4;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&USART3->DR);     /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART3_DMA_Buffer_Tx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART3_DMA_BufferSize_Tx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA1_Stream3);                         /* Deinitialize the DMA1 Stream3 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE); /* Wait for the specified DMA1 Stream3 reset to complete. */
    
    DMA_Init(DMA1_Stream3, &DMA_InitStructure); /* Initializes the DMA1 Stream3. */
    DMA_Cmd(DMA1_Stream3, DISABLE);             /* Disables the specified DMA1 Stream3. */
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    USART4_DMA_Tx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_4;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART4->DR);      /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART4_DMA_Buffer_Tx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART4_DMA_BufferSize_Tx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA1_Stream4);                         /* Deinitialize the DMA1 Stream4 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE); /* Wait for the specified DMA1 Stream4 reset to complete. */
    
    DMA_Init(DMA1_Stream4, &DMA_InitStructure); /* Initializes the DMA1 Stream4. */
    DMA_Cmd(DMA1_Stream4, DISABLE);             /* Disables the specified DMA1 Stream4. */
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    USART5_DMA_Tx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_4;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART5->DR);      /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART5_DMA_Buffer_Tx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART5_DMA_BufferSize_Tx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA1_Stream7);                         /* Deinitialize the DMA1 Stream7 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE); /* Wait for the specified DMA1 Stream7 reset to complete. */
    
    DMA_Init(DMA1_Stream7, &DMA_InitStructure); /* Initializes the DMA1 Stream7. */
    DMA_Cmd(DMA1_Stream7, DISABLE);             /* Disables the specified DMA1 Stream7. */
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    USART6_DMA_Tx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_5;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&USART6->DR);     /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART6_DMA_Buffer_Tx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART6_DMA_BufferSize_Tx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA2_Stream6);                         /* Deinitialize the DMA2 Stream6 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA2_Stream6) != DISABLE); /* Wait for the specified DMA2 Stream6 reset to complete. */
    
    DMA_Init(DMA2_Stream6, &DMA_InitStructure); /* Initializes the DMA2 Stream6. */
    DMA_Cmd(DMA2_Stream6, DISABLE);             /* Disables the specified DMA2 Stream6. */
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    USART7_DMA_Tx_Flag = true;
    
    DMA_InitStructure.DMA_Channel = DMA_Channel_5;                          /* Channel selection */
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)(&UART7->DR);      /* Set the DMA source: peripheral data register address */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)USART7_DMA_Buffer_Tx; /* Memory address */
    DMA_InitStructure.DMA_BufferSize = USART7_DMA_BufferSize_Tx;            /* Specifies the DMA channel DMA buffer size */
    
    DMA_DeInit(DMA1_Stream1);                         /* Deinitialize the DMA1 Stream1 registers to their default reset values. */
    while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE); /* Wait for the specified DMA1 Stream1 reset to complete. */
    
    DMA_Init(DMA1_Stream1, &DMA_InitStructure); /* Initializes the DMA1 Stream1. */
    DMA_Cmd(DMA1_Stream1, DISABLE);             /* Disables the specified DMA1 Stream1. */
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    USART8_DMA_Tx_Flag = true;
    
