XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
      DMA_DeInit(DMA1_Stream0);                         /* Deinitialize the DMA1 Stream0 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE); /* Wait for the specified DMA1 Stream0 reset to complete. */
    }
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    if(USART9_DMA_Tx_Flag == true)
    {
      USART9_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA2_Stream0);                         /* Deinitialize the DMA2 Stream0 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE); /* Wait for the specified DMA2 Stream0 reset to complete. */
    }
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    if(USART10_DMA_Tx_Flag == true)
    {
      USART10_DMA_Tx_Flag = false;
      
      DMA_DeInit(DMA2_Stream7);                         /* Deinitialize the DMA2 Stream7 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE); /* Wait for the specified DMA2 Stream7 reset to complete. */
    }
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_DMA_RX_Unconfigure
 * Description: USART DMA RX Unconfigure.
 * Input:       USARTx
 * Output:
 * Return:
*****************************************************************/
static void USART_DMA_RX_Unconfigure(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    if(USART1_DMA_Rx_Flag == true)
    {
      USART1_DMA_Rx_Flag = false;
      
      DMA_DeInit(DMA2_Stream2);                         /* Deinitialize the DMA2 Stream2 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA2_Stream2) != DISABLE); /* Wait for the specified DMA2 Stream2 reset to complete. */
    }
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    if(USART2_DMA_Rx_Flag == true)
    {
      USART2_DMA_Rx_Flag = false;
      
      DMA_DeInit(DMA1_Stream5);                         /* Deinitialize the DMA1 Stream5 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream5) != DISABLE); /* Wait for the specified DMA1 Stream5 reset to complete. */
    }
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    if(USART3_DMA_Rx_Flag == true)
    {
      USART3_DMA_Rx_Flag = false;
      
      DMA_DeInit(DMA1_Stream1);                         /* Deinitialize the DMA1 Stream1 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE); /* Wait for the specified DMA1 Stream1 reset to complete. */
    }
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    if(USART4_DMA_Rx_Flag == true)
    {
      USART4_DMA_Rx_Flag = false;
      
      DMA_DeInit(DMA1_Stream2);                         /* Deinitialize the DMA1 Stream2 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream2) != DISABLE); /* Wait for the specified DMA1 Stream2 reset to complete. */
    }
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    if(USART5_DMA_Rx_Flag == true)
    {
      USART5_DMA_Rx_Flag = false;
      
      DMA_DeInit(DMA1_Stream0);                         /* Deinitialize the DMA1 Stream0 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE); /* Wait for the specified DMA1 Stream0 reset to complete. */
    }
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    if(USART6_DMA_Rx_Flag == true)
    {
      USART6_DMA_Rx_Flag = false;
      
      DMA_DeInit(DMA2_Stream1);                         /* Deinitialize the DMA2 Stream1 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA2_Stream1) != DISABLE); /* Wait for the specified DMA2 Stream1 reset to complete. */
    }
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    if(USART7_DMA_Rx_Flag == true)
    {
      USART7_DMA_Rx_Flag = false;
      
      DMA_DeInit(DMA1_Stream3);                         /* Deinitialize the DMA1 Stream3 registers to their default reset values. */
      while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE); /* Wait for the specified DMA1 Stream3 reset to complete. */
    }
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    if(USART8_DMA_Rx_Flag == true)
    {
      USART8_DMA_Rx_Flag = false;
      
