XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
      NVIC_InitStructure.NVIC_IRQChannel = UART10_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART10_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART10_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx) */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_NVIC_Unconfigure
 * Description: USART NVIC Unconfigure.
 * Input:       USARTx
 * Output:
 * Return:
*****************************************************************/
static void USART_NVIC_Unconfigure(USART_TypeDef* USARTx)
{
  NVIC_InitTypeDef NVIC_InitStructure;
  
  if(USARTx == USART1)
  {
#if (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx)
    if(USART1_NVIC_Flag == true)
    {
      USART1_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART1_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART1_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx) */
  }
  else if(USARTx == USART2)
  {
#if (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx)
    if(USART2_NVIC_Flag == true)
    {
      USART2_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART2_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART2_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx) */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx)
    if(USART3_NVIC_Flag == true)
    {
      USART3_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART3_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART3_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx) */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx)
    if(USART4_NVIC_Flag == true)
    {
      USART4_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART4_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART4_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx) || (USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART5)
  {
#if (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx)
    if(USART5_NVIC_Flag == true)
    {
      USART5_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART5_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART5_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART5_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx) || (USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx) */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx)
    if(USART6_NVIC_Flag == true)
    {
      USART6_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = USART6_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART6_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART6_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx) || (USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx) */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx)
    if(USART7_NVIC_Flag == true)
    {
      USART7_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART7_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART7_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART7_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART8)
  {
#if (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx)
    if(USART8_NVIC_Flag == true)
    {
      USART8_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART8_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART8_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART8_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx) */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx)
    if(USART9_NVIC_Flag == true)
    {
      USART9_NVIC_Flag = false;
      
      NVIC_InitStructure.NVIC_IRQChannel = UART9_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART9_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART9_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART10)
  {
#if (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx)
    if(USART10_NVIC_Flag == true)
    {
      USART10_NVIC_Flag = false;
      
