XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
      NVIC_InitStructure.NVIC_IRQChannel = UART10_IRQn;
      NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = USART10_IRQ_PreemptionPriority;
      NVIC_InitStructure.NVIC_IRQChannelSubPriority = USART10_IRQ_SubPriority;
      NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
      NVIC_Init(&NVIC_InitStructure);
    }
#endif /* (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx) */
  }
#endif /* STM32F413_423xx */
}

/****************************************************************
 * Function:    USART_SetSendData
 * Description: USART Set Send Data.
 * Input:       USARTx
                Buffer
                BufferSize
 * Output:
 * Return:      Send Data Number
*****************************************************************/
uint32_t USART_SetSendData(USART_TypeDef* USARTx, void* Buffer, uint32_t BufferSize)
{
  if((Buffer == NULL) || (BufferSize == NULL))
  {
    return NULL;
  }
  
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    if((USART1_RCC_Flag == false) || (USART1_GPIO_Flag == false) || (USART1_DMA_Tx_Flag == false) || (USART1_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART1_BufferSize_Tx - USART1_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART1_Buffer_Tx + USART1_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART1_SendData_P += BufferSize;
    
    if(USART1_SendData_Flag == false)
    {
      USART1_SendData_Flag = true;
      
      if(USART1_SendData_P > USART1_DMA_BufferSize_Tx)
      {
        memcpy(USART1_DMA_Buffer_Tx, USART1_Buffer_Tx, USART1_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART1_Buffer_Tx, USART1_Buffer_Tx + USART1_DMA_BufferSize_Tx, USART1_SendData_P - USART1_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                    /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                 /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);               /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART1_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                  /* Enables the specified DMA2 Stream7. */
        
        USART1_SendData_P -= USART1_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART1_DMA_Buffer_Tx, USART1_Buffer_Tx, USART1_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);             /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                          /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);        /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART1_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                           /* Enables the specified DMA2 Stream7. */
        
        USART1_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    if((USART2_RCC_Flag == false) || (USART2_GPIO_Flag == false) || (USART2_DMA_Tx_Flag == false) || (USART2_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART2_BufferSize_Tx - USART2_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART2_Buffer_Tx + USART2_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART2_SendData_P += BufferSize;
    
    if(USART2_SendData_Flag == false)
    {
      USART2_SendData_Flag = true;
      
      if(USART2_SendData_P > USART2_DMA_BufferSize_Tx)
      {
        memcpy(USART2_DMA_Buffer_Tx, USART2_Buffer_Tx, USART2_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART2_Buffer_Tx, USART2_Buffer_Tx + USART2_DMA_BufferSize_Tx, USART2_SendData_P - USART2_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream6, DMA_FLAG_TCIF6);                    /* Clears the DMA1 Stream6's pending flags. */
        DMA_Cmd(DMA1_Stream6, DISABLE);                                 /* Disables the specified DMA1 Stream6. */
        while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);               /* Wait for the specified DMA1 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream6, USART2_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
        DMA_Cmd(DMA1_Stream6, ENABLE);                                  /* Enables the specified DMA1 Stream6. */
        
        USART2_SendData_P -= USART2_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART2_DMA_Buffer_Tx, USART2_Buffer_Tx, USART2_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream6, DMA_FLAG_TCIF6);             /* Clears the DMA1 Stream6's pending flags. */
        DMA_Cmd(DMA1_Stream6, DISABLE);                          /* Disables the specified DMA1 Stream6. */
        while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);        /* Wait for the specified DMA1 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream6, USART2_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
        DMA_Cmd(DMA1_Stream6, ENABLE);                           /* Enables the specified DMA1 Stream6. */
        
        USART2_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    if((USART3_RCC_Flag == false) || (USART3_GPIO_Flag == false) || (USART3_DMA_Tx_Flag == false) || (USART3_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART3_BufferSize_Tx - USART3_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART3_Buffer_Tx + USART3_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART3_SendData_P += BufferSize;
    
