XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    if(USART3_SendData_Flag == false)
    {
      USART3_SendData_Flag = true;
      
      if(USART3_SendData_P > USART3_DMA_BufferSize_Tx)
      {
        memcpy(USART3_DMA_Buffer_Tx, USART3_Buffer_Tx, USART3_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART3_Buffer_Tx, USART3_Buffer_Tx + USART3_DMA_BufferSize_Tx, USART3_SendData_P - USART3_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);                    /* Clears the DMA1 Stream3's pending flags. */
        DMA_Cmd(DMA1_Stream3, DISABLE);                                 /* Disables the specified DMA1 Stream3. */
        while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE);               /* Wait for the specified DMA1 Stream3 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream3, USART3_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream3. */
        DMA_Cmd(DMA1_Stream3, ENABLE);                                  /* Enables the specified DMA1 Stream3. */
        
        USART3_SendData_P -= USART3_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART3_DMA_Buffer_Tx, USART3_Buffer_Tx, USART3_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);             /* Clears the DMA1 Stream3's pending flags. */
        DMA_Cmd(DMA1_Stream3, DISABLE);                          /* Disables the specified DMA1 Stream3. */
        while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE);        /* Wait for the specified DMA1 Stream3 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream3, USART3_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream3. */
        DMA_Cmd(DMA1_Stream3, ENABLE);                           /* Enables the specified DMA1 Stream3. */
        
        USART3_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
    if((USART4_RCC_Flag == false) || (USART4_GPIO_Flag == false) || (USART4_DMA_Tx_Flag == false) || (USART4_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART4_BufferSize_Tx - USART4_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART4_Buffer_Tx + USART4_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART4_SendData_P += BufferSize;
    
    if(USART4_SendData_Flag == false)
    {
      USART4_SendData_Flag = true;
      
      if(USART4_SendData_P > USART4_DMA_BufferSize_Tx)
      {
        memcpy(USART4_DMA_Buffer_Tx, USART4_Buffer_Tx, USART4_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART4_Buffer_Tx, USART4_Buffer_Tx + USART4_DMA_BufferSize_Tx, USART4_SendData_P - USART4_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);                    /* Clears the DMA1 Stream4's pending flags. */
        DMA_Cmd(DMA1_Stream4, DISABLE);                                 /* Disables the specified DMA1 Stream4. */
        while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE);               /* Wait for the specified DMA1 Stream4 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream4, USART4_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream4. */
        DMA_Cmd(DMA1_Stream4, ENABLE);                                  /* Enables the specified DMA1 Stream4. */
        
        USART4_SendData_P -= USART4_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART4_DMA_Buffer_Tx, USART4_Buffer_Tx, USART4_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);             /* Clears the DMA1 Stream4's pending flags. */
        DMA_Cmd(DMA1_Stream4, DISABLE);                          /* Disables the specified DMA1 Stream4. */
        while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE);        /* Wait for the specified DMA1 Stream4 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream4, USART4_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream4. */
        DMA_Cmd(DMA1_Stream4, ENABLE);                           /* Enables the specified DMA1 Stream4. */
        
        USART4_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
    if((USART5_RCC_Flag == false) || (USART5_GPIO_Flag == false) || (USART5_DMA_Tx_Flag == false) || (USART5_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART5_BufferSize_Tx - USART5_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART5_Buffer_Tx + USART5_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART5_SendData_P += BufferSize;
    
    if(USART5_SendData_Flag == false)
    {
      USART5_SendData_Flag = true;
      
      if(USART5_SendData_P > USART5_DMA_BufferSize_Tx)
      {
        memcpy(USART5_DMA_Buffer_Tx, USART5_Buffer_Tx, USART5_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART5_Buffer_Tx, USART5_Buffer_Tx + USART5_DMA_BufferSize_Tx, USART5_SendData_P - USART5_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream7, DMA_FLAG_TCIF7);                    /* Clears the DMA1 Stream7's pending flags. */
        DMA_Cmd(DMA1_Stream7, DISABLE);                                 /* Disables the specified DMA1 Stream7. */
        while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE);               /* Wait for the specified DMA1 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream7, USART5_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream7. */
        DMA_Cmd(DMA1_Stream7, ENABLE);                                  /* Enables the specified DMA1 Stream7. */
        
