XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
        USART5_SendData_P -= USART5_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART5_DMA_Buffer_Tx, USART5_Buffer_Tx, USART5_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream7, DMA_FLAG_TCIF7);             /* Clears the DMA1 Stream7's pending flags. */
        DMA_Cmd(DMA1_Stream7, DISABLE);                          /* Disables the specified DMA1 Stream7. */
        while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE);        /* Wait for the specified DMA1 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream7, USART5_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream7. */
        DMA_Cmd(DMA1_Stream7, ENABLE);                           /* Enables the specified DMA1 Stream7. */
        
        USART5_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
    if((USART6_RCC_Flag == false) || (USART6_GPIO_Flag == false) || (USART6_DMA_Tx_Flag == false) || (USART6_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART6_BufferSize_Tx - USART6_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART6_Buffer_Tx + USART6_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART6_SendData_P += BufferSize;
    
    if(USART6_SendData_Flag == false)
    {
      USART6_SendData_Flag = true;
      
      if(USART6_SendData_P > USART6_DMA_BufferSize_Tx)
      {
        memcpy(USART6_DMA_Buffer_Tx, USART6_Buffer_Tx, USART6_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART6_Buffer_Tx, USART6_Buffer_Tx + USART6_DMA_BufferSize_Tx, USART6_SendData_P - USART6_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream6, DMA_FLAG_TCIF6);                    /* Clears the DMA2 Stream6's pending flags. */
        DMA_Cmd(DMA2_Stream6, DISABLE);                                 /* Disables the specified DMA2 Stream6. */
        while(DMA_GetCmdStatus(DMA2_Stream6) != DISABLE);               /* Wait for the specified DMA2 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream6, USART6_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream6. */
        DMA_Cmd(DMA2_Stream6, ENABLE);                                  /* Enables the specified DMA2 Stream6. */
        
        USART6_SendData_P -= USART6_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART6_DMA_Buffer_Tx, USART6_Buffer_Tx, USART6_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream6, DMA_FLAG_TCIF6);             /* Clears the DMA2 Stream6's pending flags. */
        DMA_Cmd(DMA2_Stream6, DISABLE);                          /* Disables the specified DMA2 Stream6. */
        while(DMA_GetCmdStatus(DMA2_Stream6) != DISABLE);        /* Wait for the specified DMA2 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream6, USART6_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream6. */
        DMA_Cmd(DMA2_Stream6, ENABLE);                           /* Enables the specified DMA2 Stream6. */
        
        USART6_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
    if((USART7_RCC_Flag == false) || (USART7_GPIO_Flag == false) || (USART7_DMA_Tx_Flag == false) || (USART7_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART7_BufferSize_Tx - USART7_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART7_Buffer_Tx + USART7_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART7_SendData_P += BufferSize;
    
    if(USART7_SendData_Flag == false)
    {
      USART7_SendData_Flag = true;
      
      if(USART7_SendData_P > USART7_DMA_BufferSize_Tx)
      {
        memcpy(USART7_DMA_Buffer_Tx, USART7_Buffer_Tx, USART7_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART7_Buffer_Tx, USART7_Buffer_Tx + USART7_DMA_BufferSize_Tx, USART7_SendData_P - USART7_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);                    /* Clears the DMA1 Stream1's pending flags. */
        DMA_Cmd(DMA1_Stream1, DISABLE);                                 /* Disables the specified DMA1 Stream1. */
        while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);               /* Wait for the specified DMA1 Stream1 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream1, USART7_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
        DMA_Cmd(DMA1_Stream1, ENABLE);                                  /* Enables the specified DMA1 Stream1. */
        
        USART7_SendData_P -= USART7_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART7_DMA_Buffer_Tx, USART7_Buffer_Tx, USART7_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);             /* Clears the DMA1 Stream1's pending flags. */
        DMA_Cmd(DMA1_Stream1, DISABLE);                          /* Disables the specified DMA1 Stream1. */
        while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);        /* Wait for the specified DMA1 Stream1 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream1, USART7_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
        DMA_Cmd(DMA1_Stream1, ENABLE);                           /* Enables the specified DMA1 Stream1. */
        
        USART7_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    if((USART8_RCC_Flag == false) || (USART8_GPIO_Flag == false) || (USART8_DMA_Tx_Flag == false) || (USART8_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART8_BufferSize_Tx - USART8_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART8_Buffer_Tx + USART8_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART8_SendData_P += BufferSize;
    
