XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    if(USART8_SendData_Flag == false)
    {
      USART8_SendData_Flag = true;
      
      if(USART8_SendData_P > USART8_DMA_BufferSize_Tx)
      {
        memcpy(USART8_DMA_Buffer_Tx, USART8_Buffer_Tx, USART8_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART8_Buffer_Tx, USART8_Buffer_Tx + USART8_DMA_BufferSize_Tx, USART8_SendData_P - USART8_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);                    /* Clears the DMA1 Stream0's pending flags. */
        DMA_Cmd(DMA1_Stream0, DISABLE);                                 /* Disables the specified DMA1 Stream0. */
        while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);               /* Wait for the specified DMA1 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream0, USART8_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
        DMA_Cmd(DMA1_Stream0, ENABLE);                                  /* Enables the specified DMA1 Stream0. */
        
        USART8_SendData_P -= USART8_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART8_DMA_Buffer_Tx, USART8_Buffer_Tx, USART8_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);             /* Clears the DMA1 Stream0's pending flags. */
        DMA_Cmd(DMA1_Stream0, DISABLE);                          /* Disables the specified DMA1 Stream0. */
        while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);        /* Wait for the specified DMA1 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream0, USART8_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
        DMA_Cmd(DMA1_Stream0, ENABLE);                           /* Enables the specified DMA1 Stream0. */
        
        USART8_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    if((USART9_RCC_Flag == false) || (USART9_GPIO_Flag == false) || (USART9_DMA_Tx_Flag == false) || (USART9_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART9_BufferSize_Tx - USART9_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART9_Buffer_Tx + USART9_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART9_SendData_P += BufferSize;
    
    if(USART9_SendData_Flag == false)
    {
      USART9_SendData_Flag = true;
      
      if(USART9_SendData_P > USART9_DMA_BufferSize_Tx)
      {
        memcpy(USART9_DMA_Buffer_Tx, USART9_Buffer_Tx, USART9_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART9_Buffer_Tx, USART9_Buffer_Tx + USART9_DMA_BufferSize_Tx, USART9_SendData_P - USART9_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);                    /* Clears the DMA2 Stream0's pending flags. */
        DMA_Cmd(DMA2_Stream0, DISABLE);                                 /* Disables the specified DMA2 Stream0. */
        while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);               /* Wait for the specified DMA2 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream0, USART9_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream0. */
        DMA_Cmd(DMA2_Stream0, ENABLE);                                  /* Enables the specified DMA2 Stream0. */
        
        USART9_SendData_P -= USART9_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART9_DMA_Buffer_Tx, USART9_Buffer_Tx, USART9_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);             /* Clears the DMA2 Stream0's pending flags. */
        DMA_Cmd(DMA2_Stream0, DISABLE);                          /* Disables the specified DMA2 Stream0. */
        while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);        /* Wait for the specified DMA2 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream0, USART9_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream0. */
        DMA_Cmd(DMA2_Stream0, ENABLE);                           /* Enables the specified DMA2 Stream0. */
        
        USART9_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    if((USART10_RCC_Flag == false) || (USART10_GPIO_Flag == false) || (USART10_DMA_Tx_Flag == false) || (USART10_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(BufferSize > (USART10_BufferSize_Tx - USART10_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART10_Buffer_Tx + USART10_SendData_P, Buffer, BufferSize); /* Copy memory */
    USART10_SendData_P += BufferSize;
    
    if(USART10_SendData_Flag == false)
    {
      USART10_SendData_Flag = true;
      
      if(USART10_SendData_P > USART10_DMA_BufferSize_Tx)
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_DMA_BufferSize_Tx);                                               /* Copy memory */
        memmove(USART10_Buffer_Tx, USART10_Buffer_Tx + USART10_DMA_BufferSize_Tx, USART10_SendData_P - USART10_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                      /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                   /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);                 /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_DMA_BufferSize_Tx);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                    /* Enables the specified DMA2 Stream7. */
        
