XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
        USART10_SendData_P -= USART10_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);               /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                            /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);          /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_SendData_P);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                             /* Enables the specified DMA2 Stream7. */
        
        USART10_SendData_P = NULL;
      }
    }
    
    return BufferSize;
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
  
  return NULL;
}

/****************************************************************
 * Function:    USART_GetReceiveData
 * Description: USART Get Receive Data.
 * Input:       USARTx
 *              Buffer
 *              BufferSize
 * Output:
 * Return:      Receive Data Number
*****************************************************************/
uint32_t USART_GetReceiveData(USART_TypeDef* USARTx, void* Buffer, uint32_t BufferSize)
{
  uint32_t number = NULL;
  
  if((Buffer == NULL) || (BufferSize == NULL))
  {
    return NULL;
  }
  
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    if((USART1_RCC_Flag == false) || (USART1_GPIO_Flag == false) || (USART1_DMA_Rx_Flag == false) || (USART1_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART1_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART1_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART1_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART1_Buffer_Rx, USART1_Buffer_Rx + BufferSize, USART1_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART1_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART1_Buffer_Rx, USART1_ReceiveData_P); /* Copy memory */
      
      number = USART1_ReceiveData_P;
      USART1_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    if((USART2_RCC_Flag == false) || (USART2_GPIO_Flag == false) || (USART2_DMA_Rx_Flag == false) || (USART2_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART2_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART2_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART2_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART2_Buffer_Rx, USART2_Buffer_Rx + BufferSize, USART2_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART2_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART2_Buffer_Rx, USART2_ReceiveData_P); /* Copy memory */
      
      number = USART2_ReceiveData_P;
      USART2_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    if((USART3_RCC_Flag == false) || (USART3_GPIO_Flag == false) || (USART3_DMA_Rx_Flag == false) || (USART3_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART3_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART3_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART3_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART3_Buffer_Rx, USART3_Buffer_Rx + BufferSize, USART3_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART3_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART3_Buffer_Rx, USART3_ReceiveData_P); /* Copy memory */
      
      number = USART3_ReceiveData_P;
      USART3_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    if((USART4_RCC_Flag == false) || (USART4_GPIO_Flag == false) || (USART4_DMA_Rx_Flag == false) || (USART4_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART4_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART4_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART4_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART4_Buffer_Rx, USART4_Buffer_Rx + BufferSize, USART4_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART4_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART4_Buffer_Rx, USART4_ReceiveData_P); /* Copy memory */
      
      number = USART4_ReceiveData_P;
      USART4_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    if((USART5_RCC_Flag == false) || (USART5_GPIO_Flag == false) || (USART5_DMA_Rx_Flag == false) || (USART5_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART5_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART5_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART5_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART5_Buffer_Rx, USART5_Buffer_Rx + BufferSize, USART5_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART5_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART5_Buffer_Rx, USART5_ReceiveData_P); /* Copy memory */
      
      number = USART5_ReceiveData_P;
      USART5_ReceiveData_P = NULL;
    }
    
