XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    return number;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    if((USART6_RCC_Flag == false) || (USART6_GPIO_Flag == false) || (USART6_DMA_Rx_Flag == false) || (USART6_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART6_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART6_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART6_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART6_Buffer_Rx, USART6_Buffer_Rx + BufferSize, USART6_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART6_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART6_Buffer_Rx, USART6_ReceiveData_P); /* Copy memory */
      
      number = USART6_ReceiveData_P;
      USART6_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    if((USART7_RCC_Flag == false) || (USART7_GPIO_Flag == false) || (USART7_DMA_Rx_Flag == false) || (USART7_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART7_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART7_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART7_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART7_Buffer_Rx, USART7_Buffer_Rx + BufferSize, USART7_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART7_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART7_Buffer_Rx, USART7_ReceiveData_P); /* Copy memory */
      
      number = USART7_ReceiveData_P;
      USART7_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    if((USART8_RCC_Flag == false) || (USART8_GPIO_Flag == false) || (USART8_DMA_Rx_Flag == false) || (USART8_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART8_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART8_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART8_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART8_Buffer_Rx, USART8_Buffer_Rx + BufferSize, USART8_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART8_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART8_Buffer_Rx, USART8_ReceiveData_P); /* Copy memory */
      
      number = USART8_ReceiveData_P;
      USART8_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    if((USART9_RCC_Flag == false) || (USART9_GPIO_Flag == false) || (USART9_DMA_Rx_Flag == false) || (USART9_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART9_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART9_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART9_Buffer_Rx, BufferSize);                                                 /* Copy memory */
      memmove(USART9_Buffer_Rx, USART9_Buffer_Rx + BufferSize, USART9_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART9_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART9_Buffer_Rx, USART9_ReceiveData_P); /* Copy memory */
      
      number = USART9_ReceiveData_P;
      USART9_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
    if((USART10_RCC_Flag == false) || (USART10_GPIO_Flag == false) || (USART10_DMA_Rx_Flag == false) || (USART10_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART10_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART10_ReceiveData_P > BufferSize)
    {
      memcpy(Buffer, USART10_Buffer_Rx, BufferSize);                                                   /* Copy memory */
      memmove(USART10_Buffer_Rx, USART10_Buffer_Rx + BufferSize, USART10_ReceiveData_P - BufferSize);  /* Copy memory */
      
      number = BufferSize;
      USART10_ReceiveData_P -= BufferSize;
    }
    else
    {
      memcpy(Buffer, USART10_Buffer_Rx, USART10_ReceiveData_P); /* Copy memory */
      
      number = USART10_ReceiveData_P;
      USART10_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
  }
#endif /* STM32F413_423xx */
  
  return NULL;
}

/****************************************************************
 * Function:    USART1_IRQHandler
 * Description: USART1 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void USART1_IRQHandler(void)
{
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
  if(USART_GetITStatus(USART1, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(USART1, USART_IT_TC);
    
    if(USART1_SendData_P == NULL)
    {
      USART1_SendData_Flag = false;
      
      USART_SendDataFinishCallback(USART1);
    }
    else
    {
      if(USART1_SendData_P > USART1_DMA_BufferSize_Tx)
      {
        memcpy(USART1_DMA_Buffer_Tx, USART1_Buffer_Tx, USART1_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART1_Buffer_Tx, USART1_Buffer_Tx + USART1_DMA_BufferSize_Tx, USART1_SendData_P - USART1_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                    /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                 /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);               /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART1_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                  /* Enables the specified DMA2 Stream7. */
        
        USART1_SendData_P -= USART1_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART1_DMA_Buffer_Tx, USART1_Buffer_Tx, USART1_SendData_P); /* Copy memory */
        
