XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);             /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                          /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);        /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART1_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                           /* Enables the specified DMA2 Stream7. */
        
        USART1_SendData_P = NULL;
      }
    }
  }
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
  
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
  if(USART_GetITStatus(USART1, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(USART1);
    
    uint32_t number = USART1_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream2); /* Returns the number of remaining data units in the current DMA2 Stream2 transfer. */;
    
    if(number > (USART1_BufferSize_Rx - USART1_ReceiveData_P))
    {
      if(number < USART1_BufferSize_Rx)
      {
        memmove(USART1_Buffer_Rx, USART1_Buffer_Rx + (number - (USART1_BufferSize_Rx - USART1_ReceiveData_P)), USART1_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART1_Buffer_Rx + (USART1_BufferSize_Rx - number), USART1_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART1_Buffer_Rx, USART1_DMA_Buffer_Rx + (number - USART1_BufferSize_Rx), USART1_BufferSize_Rx); /* Copy memory */
      }
      
      USART1_ReceiveData_P = USART1_BufferSize_Rx;
    }
    else
    {
      memcpy(USART1_Buffer_Rx + USART1_ReceiveData_P, USART1_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART1_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream2, DISABLE);                                 /* Disables the specified DMA2 Stream2. */
    while(DMA_GetCmdStatus(DMA2_Stream2) != DISABLE);               /* Wait for the specified DMA2 Stream2 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream2, USART1_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream2. */
    DMA_Cmd(DMA2_Stream2, ENABLE);                                  /* Enables the specified DMA2 Stream2. */
    
    USART_ReceiveDataFinishCallback(USART1);
  }
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    USART2_IRQHandler
 * Description: USART2 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void USART2_IRQHandler(void)
{
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
  if(USART_GetITStatus(USART2, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(USART2, USART_IT_TC);
    
    if(USART2_SendData_P == NULL)
    {
      USART2_SendData_Flag = false;
      
      USART_SendDataFinishCallback(USART2);
    }
    else
    {
      if(USART2_SendData_P > USART2_DMA_BufferSize_Tx)
      {
        memcpy(USART2_DMA_Buffer_Tx, USART2_Buffer_Tx, USART2_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART2_Buffer_Tx, USART2_Buffer_Tx + USART2_DMA_BufferSize_Tx, USART2_SendData_P - USART2_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream6, DMA_FLAG_TCIF6);                    /* Clears the DMA1 Stream6's pending flags. */
        DMA_Cmd(DMA1_Stream6, DISABLE);                                 /* Disables the specified DMA1 Stream6. */
        while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);               /* Wait for the specified DMA1 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream6, USART2_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
        DMA_Cmd(DMA1_Stream6, ENABLE);                                  /* Enables the specified DMA1 Stream6. */
        
        USART2_SendData_P -= USART2_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART2_DMA_Buffer_Tx, USART2_Buffer_Tx, USART2_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream6, DMA_FLAG_TCIF6);             /* Clears the DMA1 Stream6's pending flags. */
        DMA_Cmd(DMA1_Stream6, DISABLE);                          /* Disables the specified DMA1 Stream6. */
        while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);        /* Wait for the specified DMA1 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream6, USART2_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
        DMA_Cmd(DMA1_Stream6, ENABLE);                           /* Enables the specified DMA1 Stream6. */
        
        USART2_SendData_P = NULL;
      }
    }
  }
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
  
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
  if(USART_GetITStatus(USART2, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(USART2);
    
    uint32_t number = USART2_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream5); /* Returns the number of remaining data units in the current DMA1 Stream5 transfer. */;
    
    if(number > (USART2_BufferSize_Rx - USART2_ReceiveData_P))
    {
      if(number < USART2_BufferSize_Rx)
      {
        memmove(USART2_Buffer_Rx, USART2_Buffer_Rx + (number - (USART2_BufferSize_Rx - USART2_ReceiveData_P)), USART2_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART2_Buffer_Rx + (USART2_BufferSize_Rx - number), USART2_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART2_Buffer_Rx, USART2_DMA_Buffer_Rx + (number - USART2_BufferSize_Rx), USART2_BufferSize_Rx); /* Copy memory */
      }
      
      USART2_ReceiveData_P = USART2_BufferSize_Rx;
    }
    else
    {
      memcpy(USART2_Buffer_Rx + USART2_ReceiveData_P, USART2_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART2_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA1_Stream5, DISABLE);                                 /* Disables the specified DMA1 Stream5. */
    while(DMA_GetCmdStatus(DMA1_Stream5) != DISABLE);               /* Wait for the specified DMA1 Stream5 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream5, USART2_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream5. */
    DMA_Cmd(DMA1_Stream5, ENABLE);                                  /* Enables the specified DMA1 Stream5. */
    
    USART_ReceiveDataFinishCallback(USART2);
  }
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
}

