XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
/****************************************************************
 * Function:    USART3_IRQHandler
 * Description: USART3 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void USART3_IRQHandler(void)
{
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
  if(USART_GetITStatus(USART3, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(USART3, USART_IT_TC);
    
    if(USART3_SendData_P == NULL)
    {
      USART3_SendData_Flag = false;
      
      USART_SendDataFinishCallback(USART3);
    }
    else
    {
      if(USART3_SendData_P > USART3_DMA_BufferSize_Tx)
      {
        memcpy(USART3_DMA_Buffer_Tx, USART3_Buffer_Tx, USART3_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART3_Buffer_Tx, USART3_Buffer_Tx + USART3_DMA_BufferSize_Tx, USART3_SendData_P - USART3_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);                    /* Clears the DMA1 Stream3's pending flags. */
        DMA_Cmd(DMA1_Stream3, DISABLE);                                 /* Disables the specified DMA1 Stream3. */
        while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE);               /* Wait for the specified DMA1 Stream3 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream3, USART3_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream3. */
        DMA_Cmd(DMA1_Stream3, ENABLE);                                  /* Enables the specified DMA1 Stream3. */
        
        USART3_SendData_P -= USART3_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART3_DMA_Buffer_Tx, USART3_Buffer_Tx, USART3_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream3, DMA_FLAG_TCIF3);             /* Clears the DMA1 Stream3's pending flags. */
        DMA_Cmd(DMA1_Stream3, DISABLE);                          /* Disables the specified DMA1 Stream3. */
        while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE);        /* Wait for the specified DMA1 Stream3 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream3, USART3_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream3. */
        DMA_Cmd(DMA1_Stream3, ENABLE);                           /* Enables the specified DMA1 Stream3. */
        
        USART3_SendData_P = NULL;
      }
    }
  }
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
  
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
  if(USART_GetITStatus(USART3, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(USART3);
    
    uint32_t number = USART3_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream1); /* Returns the number of remaining data units in the current DMA1 Stream1 transfer. */;
    
    if(number > (USART3_BufferSize_Rx - USART3_ReceiveData_P))
    {
      if(number < USART3_BufferSize_Rx)
      {
        memmove(USART3_Buffer_Rx, USART3_Buffer_Rx + (number - (USART3_BufferSize_Rx - USART3_ReceiveData_P)), USART3_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART3_Buffer_Rx + (USART3_BufferSize_Rx - number), USART3_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART3_Buffer_Rx, USART3_DMA_Buffer_Rx + (number - USART3_BufferSize_Rx), USART3_BufferSize_Rx); /* Copy memory */
      }
      
      USART3_ReceiveData_P = USART3_BufferSize_Rx;
    }
    else
    {
      memcpy(USART3_Buffer_Rx + USART3_ReceiveData_P, USART3_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART3_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA1_Stream1, DISABLE);                                 /* Disables the specified DMA1 Stream1. */
    while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);               /* Wait for the specified DMA1 Stream1 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream1, USART3_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
    DMA_Cmd(DMA1_Stream1, ENABLE);                                  /* Enables the specified DMA1 Stream1. */
    
    USART_ReceiveDataFinishCallback(USART3);
  }
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
}
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
/****************************************************************
 * Function:    UART4_IRQHandler
 * Description: UART4 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART4_IRQHandler(void)
{
#if USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART4, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(UART4, USART_IT_TC);
    
    if(USART4_SendData_P == NULL)
    {
      USART4_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART4);
    }
    else
    {
      if(USART4_SendData_P > USART4_DMA_BufferSize_Tx)
      {
        memcpy(USART4_DMA_Buffer_Tx, USART4_Buffer_Tx, USART4_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART4_Buffer_Tx, USART4_Buffer_Tx + USART4_DMA_BufferSize_Tx, USART4_SendData_P - USART4_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);                    /* Clears the DMA1 Stream4's pending flags. */
        DMA_Cmd(DMA1_Stream4, DISABLE);                                 /* Disables the specified DMA1 Stream4. */
        while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE);               /* Wait for the specified DMA1 Stream4 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream4, USART4_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream4. */
        DMA_Cmd(DMA1_Stream4, ENABLE);                                  /* Enables the specified DMA1 Stream4. */
        
        USART4_SendData_P -= USART4_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART4_DMA_Buffer_Tx, USART4_Buffer_Tx, USART4_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream4, DMA_FLAG_TCIF4);             /* Clears the DMA1 Stream4's pending flags. */
        DMA_Cmd(DMA1_Stream4, DISABLE);                          /* Disables the specified DMA1 Stream4. */
        while(DMA_GetCmdStatus(DMA1_Stream4) != DISABLE);        /* Wait for the specified DMA1 Stream4 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream4, USART4_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream4. */
        DMA_Cmd(DMA1_Stream4, ENABLE);                           /* Enables the specified DMA1 Stream4. */
        
