XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
        USART4_SendData_P = NULL;
      }
    }
  }
#endif /* USART4_BufferSize_Tx && USART4_DMA_BufferSize_Tx */
  
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART4, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(UART4);
    
    uint32_t number = USART4_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream2); /* Returns the number of remaining data units in the current DMA1 Stream2 transfer. */;
    
    if(number > (USART4_BufferSize_Rx - USART4_ReceiveData_P))
    {
      if(number < USART4_BufferSize_Rx)
      {
        memmove(USART4_Buffer_Rx, USART4_Buffer_Rx + (number - (USART4_BufferSize_Rx - USART4_ReceiveData_P)), USART4_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART4_Buffer_Rx + (USART4_BufferSize_Rx - number), USART4_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART4_Buffer_Rx, USART4_DMA_Buffer_Rx + (number - USART4_BufferSize_Rx), USART4_BufferSize_Rx); /* Copy memory */
      }
      
      USART4_ReceiveData_P = USART4_BufferSize_Rx;
    }
    else
    {
      memcpy(USART4_Buffer_Rx + USART4_ReceiveData_P, USART4_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART4_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA1_Stream2, DISABLE);                                 /* Disables the specified DMA1 Stream2. */
    while(DMA_GetCmdStatus(DMA1_Stream2) != DISABLE);               /* Wait for the specified DMA1 Stream2 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream2, USART4_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream2. */
    DMA_Cmd(DMA1_Stream2, ENABLE);                                  /* Enables the specified DMA1 Stream2. */
    
    USART_ReceiveDataFinishCallback(UART4);
  }
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    UART5_IRQHandler
 * Description: UART5 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART5_IRQHandler(void)
{
#if USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART5, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(UART5, USART_IT_TC);
    
    if(USART5_SendData_P == NULL)
    {
      USART5_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART5);
    }
    else
    {
      if(USART5_SendData_P > USART5_DMA_BufferSize_Tx)
      {
        memcpy(USART5_DMA_Buffer_Tx, USART5_Buffer_Tx, USART5_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART5_Buffer_Tx, USART5_Buffer_Tx + USART5_DMA_BufferSize_Tx, USART5_SendData_P - USART5_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream7, DMA_FLAG_TCIF7);                    /* Clears the DMA1 Stream7's pending flags. */
        DMA_Cmd(DMA1_Stream7, DISABLE);                                 /* Disables the specified DMA1 Stream7. */
        while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE);               /* Wait for the specified DMA1 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream7, USART5_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream7. */
        DMA_Cmd(DMA1_Stream7, ENABLE);                                  /* Enables the specified DMA1 Stream7. */
        
        USART5_SendData_P -= USART5_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART5_DMA_Buffer_Tx, USART5_Buffer_Tx, USART5_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream7, DMA_FLAG_TCIF7);             /* Clears the DMA1 Stream7's pending flags. */
        DMA_Cmd(DMA1_Stream7, DISABLE);                          /* Disables the specified DMA1 Stream7. */
        while(DMA_GetCmdStatus(DMA1_Stream7) != DISABLE);        /* Wait for the specified DMA1 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream7, USART5_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream7. */
        DMA_Cmd(DMA1_Stream7, ENABLE);                           /* Enables the specified DMA1 Stream7. */
        
        USART5_SendData_P = NULL;
      }
    }
  }
#endif /* USART5_BufferSize_Tx && USART5_DMA_BufferSize_Tx */
  
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART5, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(UART5);
    
    uint32_t number = USART5_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream0); /* Returns the number of remaining data units in the current DMA1 Stream0 transfer. */;
    
    if(number > (USART5_BufferSize_Rx - USART5_ReceiveData_P))
    {
      if(number < USART5_BufferSize_Rx)
      {
        memmove(USART5_Buffer_Rx, USART5_Buffer_Rx + (number - (USART5_BufferSize_Rx - USART5_ReceiveData_P)), USART5_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART5_Buffer_Rx + (USART5_BufferSize_Rx - number), USART5_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART5_Buffer_Rx, USART5_DMA_Buffer_Rx + (number - USART5_BufferSize_Rx), USART5_BufferSize_Rx); /* Copy memory */
      }
      
      USART5_ReceiveData_P = USART5_BufferSize_Rx;
    }
    else
    {
      memcpy(USART5_Buffer_Rx + USART5_ReceiveData_P, USART5_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART5_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA1_Stream0, DISABLE);                                 /* Disables the specified DMA1 Stream0. */
    while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);               /* Wait for the specified DMA1 Stream0 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream0, USART5_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
    DMA_Cmd(DMA1_Stream0, ENABLE);                                  /* Enables the specified DMA1 Stream0. */
    
    USART_ReceiveDataFinishCallback(UART5);
  }
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
}
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */

/****************************************************************
 * Function:    USART6_IRQHandler
 * Description: USART6 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void USART6_IRQHandler(void)
{
#if USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx
  if(USART_GetITStatus(USART6, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(USART6, USART_IT_TC);
    
    if(USART6_SendData_P == NULL)
    {
      USART6_SendData_Flag = false;
      
      USART_SendDataFinishCallback(USART6);
    }
    else
    {
      if(USART6_SendData_P > USART6_DMA_BufferSize_Tx)
      {
        memcpy(USART6_DMA_Buffer_Tx, USART6_Buffer_Tx, USART6_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART6_Buffer_Tx, USART6_Buffer_Tx + USART6_DMA_BufferSize_Tx, USART6_SendData_P - USART6_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream6, DMA_FLAG_TCIF6);                    /* Clears the DMA2 Stream6's pending flags. */
        DMA_Cmd(DMA2_Stream6, DISABLE);                                 /* Disables the specified DMA2 Stream6. */
        while(DMA_GetCmdStatus(DMA2_Stream6) != DISABLE);               /* Wait for the specified DMA2 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream6, USART6_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream6. */
        DMA_Cmd(DMA2_Stream6, ENABLE);                                  /* Enables the specified DMA2 Stream6. */
        
