XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
        USART6_SendData_P -= USART6_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART6_DMA_Buffer_Tx, USART6_Buffer_Tx, USART6_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream6, DMA_FLAG_TCIF6);             /* Clears the DMA2 Stream6's pending flags. */
        DMA_Cmd(DMA2_Stream6, DISABLE);                          /* Disables the specified DMA2 Stream6. */
        while(DMA_GetCmdStatus(DMA2_Stream6) != DISABLE);        /* Wait for the specified DMA2 Stream6 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream6, USART6_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream6. */
        DMA_Cmd(DMA2_Stream6, ENABLE);                           /* Enables the specified DMA2 Stream6. */
        
        USART6_SendData_P = NULL;
      }
    }
  }
#endif /* USART6_BufferSize_Tx && USART6_DMA_BufferSize_Tx */
  
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
  if(USART_GetITStatus(USART6, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(USART6);
    
    uint32_t number = USART6_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream1); /* Returns the number of remaining data units in the current DMA2 Stream1 transfer. */;
    
    if(number > (USART6_BufferSize_Rx - USART6_ReceiveData_P))
    {
      if(number < USART6_BufferSize_Rx)
      {
        memmove(USART6_Buffer_Rx, USART6_Buffer_Rx + (number - (USART6_BufferSize_Rx - USART6_ReceiveData_P)), USART6_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART6_Buffer_Rx + (USART6_BufferSize_Rx - number), USART6_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART6_Buffer_Rx, USART6_DMA_Buffer_Rx + (number - USART6_BufferSize_Rx), USART6_BufferSize_Rx); /* Copy memory */
      }
      
      USART6_ReceiveData_P = USART6_BufferSize_Rx;
    }
    else
    {
      memcpy(USART6_Buffer_Rx + USART6_ReceiveData_P, USART6_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART6_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream1, DISABLE);                                 /* Disables the specified DMA2 Stream1. */
    while(DMA_GetCmdStatus(DMA2_Stream1) != DISABLE);               /* Wait for the specified DMA2 Stream1 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream1, USART6_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream1. */
    DMA_Cmd(DMA2_Stream1, ENABLE);                                  /* Enables the specified DMA2 Stream1. */
    
    USART_ReceiveDataFinishCallback(USART6);
  }
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
}

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
/****************************************************************
 * Function:    UART7_IRQHandler
 * Description: UART7 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART7_IRQHandler(void)
{
#if USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART7, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(UART7, USART_IT_TC);
    
    if(USART7_SendData_P == NULL)
    {
      USART7_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART7);
    }
    else
    {
      if(USART7_SendData_P > USART7_DMA_BufferSize_Tx)
      {
        memcpy(USART7_DMA_Buffer_Tx, USART7_Buffer_Tx, USART7_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART7_Buffer_Tx, USART7_Buffer_Tx + USART7_DMA_BufferSize_Tx, USART7_SendData_P - USART7_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);                    /* Clears the DMA1 Stream1's pending flags. */
        DMA_Cmd(DMA1_Stream1, DISABLE);                                 /* Disables the specified DMA1 Stream1. */
        while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);               /* Wait for the specified DMA1 Stream1 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream1, USART7_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
        DMA_Cmd(DMA1_Stream1, ENABLE);                                  /* Enables the specified DMA1 Stream1. */
        
        USART7_SendData_P -= USART7_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART7_DMA_Buffer_Tx, USART7_Buffer_Tx, USART7_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream1, DMA_FLAG_TCIF1);             /* Clears the DMA1 Stream1's pending flags. */
        DMA_Cmd(DMA1_Stream1, DISABLE);                          /* Disables the specified DMA1 Stream1. */
        while(DMA_GetCmdStatus(DMA1_Stream1) != DISABLE);        /* Wait for the specified DMA1 Stream1 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream1, USART7_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream1. */
        DMA_Cmd(DMA1_Stream1, ENABLE);                           /* Enables the specified DMA1 Stream1. */
        
        USART7_SendData_P = NULL;
      }
    }
  }
#endif /* USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx */
  
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART7, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(UART7);
    
    uint32_t number = USART7_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream3); /* Returns the number of remaining data units in the current DMA1 Stream3 transfer. */;
    
    if(number > (USART7_BufferSize_Rx - USART7_ReceiveData_P))
    {
      if(number < USART7_BufferSize_Rx)
      {
        memmove(USART7_Buffer_Rx, USART7_Buffer_Rx + (number - (USART7_BufferSize_Rx - USART7_ReceiveData_P)), USART7_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART7_Buffer_Rx + (USART7_BufferSize_Rx - number), USART7_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART7_Buffer_Rx, USART7_DMA_Buffer_Rx + (number - USART7_BufferSize_Rx), USART7_BufferSize_Rx); /* Copy memory */
      }
      
      USART7_ReceiveData_P = USART7_BufferSize_Rx;
    }
    else
    {
      memcpy(USART7_Buffer_Rx + USART7_ReceiveData_P, USART7_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART7_ReceiveData_P += number;
    }
    
