XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    DMA_Cmd(DMA1_Stream3, DISABLE);                                 /* Disables the specified DMA1 Stream3. */
    while(DMA_GetCmdStatus(DMA1_Stream3) != DISABLE);               /* Wait for the specified DMA1 Stream3 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream3, USART7_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream3. */
    DMA_Cmd(DMA1_Stream3, ENABLE);                                  /* Enables the specified DMA1 Stream3. */
    
    USART_ReceiveDataFinishCallback(UART7);
  }
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    UART8_IRQHandler
 * Description: UART8 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART8_IRQHandler(void)
{
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART8, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(UART8, USART_IT_TC);
    
    if(USART8_SendData_P == NULL)
    {
      USART8_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART8);
    }
    else
    {
      if(USART8_SendData_P > USART8_DMA_BufferSize_Tx)
      {
        memcpy(USART8_DMA_Buffer_Tx, USART8_Buffer_Tx, USART8_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART8_Buffer_Tx, USART8_Buffer_Tx + USART8_DMA_BufferSize_Tx, USART8_SendData_P - USART8_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);                    /* Clears the DMA1 Stream0's pending flags. */
        DMA_Cmd(DMA1_Stream0, DISABLE);                                 /* Disables the specified DMA1 Stream0. */
        while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);               /* Wait for the specified DMA1 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream0, USART8_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
        DMA_Cmd(DMA1_Stream0, ENABLE);                                  /* Enables the specified DMA1 Stream0. */
        
        USART8_SendData_P -= USART8_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART8_DMA_Buffer_Tx, USART8_Buffer_Tx, USART8_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA1_Stream0, DMA_FLAG_TCIF0);             /* Clears the DMA1 Stream0's pending flags. */
        DMA_Cmd(DMA1_Stream0, DISABLE);                          /* Disables the specified DMA1 Stream0. */
        while(DMA_GetCmdStatus(DMA1_Stream0) != DISABLE);        /* Wait for the specified DMA1 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA1_Stream0, USART8_SendData_P); /* Writes the number of data units to be transferred on the DMA1 Stream0. */
        DMA_Cmd(DMA1_Stream0, ENABLE);                           /* Enables the specified DMA1 Stream0. */
        
        USART8_SendData_P = NULL;
      }
    }
  }
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
  
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART8, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(UART8);
    
    uint32_t number = USART8_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA1_Stream6); /* Returns the number of remaining data units in the current DMA1 Stream6 transfer. */;
    
    if(number > (USART8_BufferSize_Rx - USART8_ReceiveData_P))
    {
      if(number < USART8_BufferSize_Rx)
      {
        memmove(USART8_Buffer_Rx, USART8_Buffer_Rx + (number - (USART8_BufferSize_Rx - USART8_ReceiveData_P)), USART8_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART8_Buffer_Rx + (USART8_BufferSize_Rx - number), USART8_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART8_Buffer_Rx, USART8_DMA_Buffer_Rx + (number - USART8_BufferSize_Rx), USART8_BufferSize_Rx); /* Copy memory */
      }
      
      USART8_ReceiveData_P = USART8_BufferSize_Rx;
    }
    else
    {
      memcpy(USART8_Buffer_Rx + USART8_ReceiveData_P, USART8_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART8_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA1_Stream6, DISABLE);                                 /* Disables the specified DMA1 Stream6. */
    while(DMA_GetCmdStatus(DMA1_Stream6) != DISABLE);               /* Wait for the specified DMA1 Stream6 disable to finish. */
    DMA_SetCurrDataCounter(DMA1_Stream6, USART8_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA1 Stream6. */
    DMA_Cmd(DMA1_Stream6, ENABLE);                                  /* Enables the specified DMA1 Stream6. */
    
    USART_ReceiveDataFinishCallback(UART8);
  }
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
}
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */

#if defined(STM32F413_423xx)
/****************************************************************
 * Function:    UART9_IRQHandler
 * Description: UART9 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART9_IRQHandler(void)
{
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART9, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(UART9, USART_IT_TC);
    
    if(USART9_SendData_P == NULL)
    {
      USART9_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART9);
    }
    else
    {
      if(USART9_SendData_P > USART9_DMA_BufferSize_Tx)
      {
        memcpy(USART9_DMA_Buffer_Tx, USART9_Buffer_Tx, USART9_DMA_BufferSize_Tx);                                             /* Copy memory */
        memmove(USART9_Buffer_Tx, USART9_Buffer_Tx + USART9_DMA_BufferSize_Tx, USART9_SendData_P - USART9_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);                    /* Clears the DMA2 Stream0's pending flags. */
        DMA_Cmd(DMA2_Stream0, DISABLE);                                 /* Disables the specified DMA2 Stream0. */
        while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);               /* Wait for the specified DMA2 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream0, USART9_DMA_BufferSize_Tx); /* Writes the number of data units to be transferred on the DMA2 Stream0. */
        DMA_Cmd(DMA2_Stream0, ENABLE);                                  /* Enables the specified DMA2 Stream0. */
        
        USART9_SendData_P -= USART9_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART9_DMA_Buffer_Tx, USART9_Buffer_Tx, USART9_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream0, DMA_FLAG_TCIF0);             /* Clears the DMA2 Stream0's pending flags. */
        DMA_Cmd(DMA2_Stream0, DISABLE);                          /* Disables the specified DMA2 Stream0. */
        while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);        /* Wait for the specified DMA2 Stream0 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream0, USART9_SendData_P); /* Writes the number of data units to be transferred on the DMA2 Stream0. */
        DMA_Cmd(DMA2_Stream0, ENABLE);                           /* Enables the specified DMA2 Stream0. */
        
        USART9_SendData_P = NULL;
      }
    }
  }
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART9, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(UART9);
    
    uint32_t number = USART9_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream7); /* Returns the number of remaining data units in the current DMA2 Stream7 transfer. */;
    
