XinLiGH/STM32F4xx_USART_Example/STM32F4xx_USART_Static_Memory_Example/User/USART/USART.c
    if(number > (USART9_BufferSize_Rx - USART9_ReceiveData_P))
    {
      if(number < USART9_BufferSize_Rx)
      {
        memmove(USART9_Buffer_Rx, USART9_Buffer_Rx + (number - (USART9_BufferSize_Rx - USART9_ReceiveData_P)), USART9_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART9_Buffer_Rx + (USART9_BufferSize_Rx - number), USART9_DMA_Buffer_Rx, number);                                               /* Copy memory */
      }
      else
      {
        memcpy(USART9_Buffer_Rx, USART9_DMA_Buffer_Rx + (number - USART9_BufferSize_Rx), USART9_BufferSize_Rx); /* Copy memory */
      }
      
      USART9_ReceiveData_P = USART9_BufferSize_Rx;
    }
    else
    {
      memcpy(USART9_Buffer_Rx + USART9_ReceiveData_P, USART9_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART9_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream7, DISABLE);                                 /* Disables the specified DMA2 Stream7. */
    while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);               /* Wait for the specified DMA2 Stream7 disable to finish. */
    DMA_SetCurrDataCounter(DMA2_Stream7, USART9_DMA_BufferSize_Rx); /* Writes the number of data units to be transferred on the DMA2 Stream7. */
    DMA_Cmd(DMA2_Stream7, ENABLE);                                  /* Enables the specified DMA2 Stream7. */
    
    USART_ReceiveDataFinishCallback(UART9);
  }
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
}

/****************************************************************
 * Function:    UART10_IRQHandler
 * Description: UART10 IRQ Handler.
 * Input:
 * Output:
 * Return:
*****************************************************************/
void UART10_IRQHandler(void)
{
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
  if(USART_GetITStatus(UART10, USART_IT_TC) != RESET)
  {
    USART_ClearITPendingBit(UART10, USART_IT_TC);
    
    if(USART10_SendData_P == NULL)
    {
      USART10_SendData_Flag = false;
      
      USART_SendDataFinishCallback(UART10);
    }
    else
    {
      if(USART10_SendData_P > USART10_DMA_BufferSize_Tx)
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_DMA_BufferSize_Tx);                                               /* Copy memory */
        memmove(USART10_Buffer_Tx, USART10_Buffer_Tx + USART10_DMA_BufferSize_Tx, USART10_SendData_P - USART10_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                      /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                   /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);                 /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_DMA_BufferSize_Tx);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                    /* Enables the specified DMA2 Stream7. */
        
        USART10_SendData_P -= USART10_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);               /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                            /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);          /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_SendData_P);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                             /* Enables the specified DMA2 Stream7. */
        
        USART10_SendData_P = NULL;
      }
    }
  }
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
  if(USART_GetITStatus(UART10, USART_IT_IDLE) != RESET)
  {
    USART_ReceiveData(UART10);
    
    uint32_t number = USART10_DMA_BufferSize_Rx - DMA_GetCurrDataCounter(DMA2_Stream0); /* Returns the number of remaining data units in the current DMA2 Stream0 transfer. */;
    
    if(number > (USART10_BufferSize_Rx - USART10_ReceiveData_P))
    {
      if(number < USART10_BufferSize_Rx)
      {
        memmove(USART10_Buffer_Rx, USART10_Buffer_Rx + (number - (USART10_BufferSize_Rx - USART10_ReceiveData_P)), USART10_BufferSize_Rx - number);  /* Copy memory */
        memcpy(USART10_Buffer_Rx + (USART10_BufferSize_Rx - number), USART10_DMA_Buffer_Rx, number);                                                 /* Copy memory */
      }
      else
      {
        memcpy(USART10_Buffer_Rx, USART10_DMA_Buffer_Rx + (number - USART10_BufferSize_Rx), USART10_BufferSize_Rx); /* Copy memory */
      }
      
      USART10_ReceiveData_P = USART10_BufferSize_Rx;
    }
    else
    {
      memcpy(USART10_Buffer_Rx + USART10_ReceiveData_P, USART10_DMA_Buffer_Rx, number); /* Copy memory */
      
      USART10_ReceiveData_P += number;
    }
    
    DMA_Cmd(DMA2_Stream0, DISABLE);                                   /* Disables the specified DMA2 Stream0. */
    while(DMA_GetCmdStatus(DMA2_Stream0) != DISABLE);                 /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_SetCurrDataCounter(DMA2_Stream0, USART10_DMA_BufferSize_Rx);  /* Writes the number of data units to be transferred on the DMA2 Stream0. */
    DMA_Cmd(DMA2_Stream0, ENABLE);                                    /* Enables the specified DMA2 Stream0. */
    
    USART_ReceiveDataFinishCallback(UART10);
  }
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
}
#endif /* STM32F413_423xx */

/****************************************************************
 * Function:    USART_SendDataFinishCallback
 * Description: USART Send Data Finish Callback.
 * Input:       USARTx
 * Output:
 * Return:
*****************************************************************/
__weak void USART_SendDataFinishCallback(USART_TypeDef* USARTx)
{
  
}

/****************************************************************
 * Function:    USART_ReceiveDataFinishCallback
 * Description: USART Receive Data Finish Callback.
 * Input:       USARTx
 * Output:
 * Return:
*****************************************************************/
__weak void USART_ReceiveDataFinishCallback(USART_TypeDef* USARTx)
{
  
}
